---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.InvalidPipeSize
source: html/eb523735-344d-3cac-fea0-7ea078e724a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.InvalidPipeSize Property

Pipe Size Table "[File Name]" is missing or invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidPipeSize { get; }
```